Функция GetUpdates(offset = 0, limit = 0, timeout = 0) Экспорт
	ПараметрыМетода = Новый Массив;

	Если ЗначениеЗаполнено(offset) Тогда
		ПараметрыМетода.Добавить("offset=" + Формат(offset, "ЧРГ = ' '; ЧГ=0"));
	КонецЕсли;

	Результат = WEBHTTP.ОтправитьHTTPЗапрос(Константы.TokenTelegram.Получить(), "getUpdates", ПараметрыМетода);
	Возврат Результат;
КонецФункции

Функция SendMessage(chat_id, text, reply_markup) Экспорт

	ПараметрыМетода = Новый Массив;
	ПараметрыМетода.Добавить("chat_id=" + Формат(chat_id, "ЧРГ = ' '; ЧГ=0"));
	ПараметрыМетода.Добавить("text=" + СокрЛП(text));
	ПараметрыМетода.Добавить("reply_markup=" + reply_markup);

	Результат = WEBHTTP.ОтправитьHTTPЗапрос(Константы.TokenTelegram.Получить(), "sendMessage", ПараметрыМетода);
	Возврат Результат;
КонецФункции
Функция ПолучитьКлавиатуру() Экспорт
	ТекстКнопок = "
				  |{
				  |	""keyboard"":[
				  |
				  |	[""Прайс лист""],
				  |	[""Остатки"", ""Кнопка 3""]
				  |]}";

	Возврат ТекстКнопок;
КонецФункции