Функция ОтправитьHTTPЗапрос(ТокенБота,Метод,ПараметрыМетода) Экспорт
	Попытка

		Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , 60, Новый ЗащищенноеСоединениеOpenSSL);
		Если ПараметрыМетода.Количество() > 0 Тогда
			ПараметрыЗапроса = "?" + СтрСоединить(ПараметрыМетода, "&");
		Иначе
			ПараметрыЗапроса = "";
		КонецЕсли;
		ПолныйПуть = "/bot" + ТокенБота + "/" + Метод + ПараметрыЗапроса;
		Запрос = Новый HTTPЗапрос(ПолныйПуть);
		Ответ = Соединение.Получить(Запрос);
		Если Ответ.КодСостояния = 200 Тогда
			Возврат Ответ.ПолучитьТелоКакСтроку();
		Иначе
			ВызватьИсключение "Ошибка запроса. Код состояния: " + Ответ.КодСостояния;
		КонецЕсли;
	Исключение
		ВызватьИсключение "Ошибка отправки HTTP-запроса: " + ОписаниеОшибки();
	КонецПопытки;
КонецФункции