&НаСервере
Процедура ОтправитьСообщениеНаСервере()

	Telegram.SendMessage("6891588067", Сообщение, Telegram.ПолучитьКлавиатуру());
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	ОтправитьСообщениеНаСервере();
КонецПроцедуры
&НаСервере
Процедура ПолучитьСообщениеНаСервере()
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , 30, SSL);

	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.Заголовки.Вставить("Content-type", "application/json");
	ЗапросHTTP.АдресРесурса = "bot" + Константы.TokenTelegram.Получить() + "/" + "getUpdates";
	ОтветHTTP = Соединение.Получить(ЗапросHTTP);

	Если ОтветHTTP.КодСостояния = 200 Тогда
		РезультатЗапроса = ФорматироватьJSON(ОтветHTTP.ПолучитьТелоКакСтроку());
		Telegram.ЗагрузитьСообщенияИзТГ(РезультатЗапроса);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСообщение(Команда)
	ПолучитьСообщениеНаСервере();
КонецПроцедуры

Функция ФорматироватьJSON(СтрокаJSON)
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ОбъектJSON = ПрочитатьJSON(Чтение);

	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);

	Возврат Запись.Закрыть();
КонецФункции